Revit 2024 API
StickSymbolLocation Enumeration
 Indicates the stick symbol location on the UI, which is used for the BuiltInParameter STRUCTURAL_STICK_SYMBOL_LOCATION.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum StickSymbolLocation
Visual Basic
Public Enumeration StickSymbolLocation
Visual C++
public enum class StickSymbolLocation
Members
Member name | Description
StickViewCenter
StickViewTop
StickViewBottom
StickViewLocLine
See Also
Autodesk.Revit.DB Namespace